arnimacs.org
#+title: Arni's literate Emacs configuration
#+author: Arni
#+startup: content indent

* An introduction

I am a huge nerd. Why would I be on Emacs otherwise?
In more seriousness, I'm quite passionate about this software.
It's one that helps me throughout each day, thanks to things like ~org-mode~, Eshell and its many editing capabilities.
I could go on, but to stay brief, it's just great being on Emacs.

Here, I'm gonna talk about Emacs and this file, as well as my motivations behind its use.

** Well, what's Emacs exactly ? And why do you use it ?

Let's talk about Emacs first.
It is often presented as a text editor, to the likes of Nano or Vim.
But, you have to realize that Emacs is not /just/ a text editor. It is often used as one, and some people use it *only* as a text editor.
In reality, Emacs is a language interpreter.
And, in specific, it interprets Emacs Lisp.
It is a Lisp-like language made specifically for this software, which does have many utilities to use this interpreter as a text editor.
If you'd like to know more about Lisp languages, you can read about it [[https://en.wikipedia.org/wiki/Lisp_(programming_language)][on Wikipedia]] !
If Emacs is a language interpreter, this means that we can write code for it and have Emacs interpret it to do whatever we want.
This would essentially make it as extensible as you wish.
Just look at the amount of Emacs packages you can download using its default package manager!

This partly ties into my reasoning behind using it on a daily basis.
I use it because of how deeply customizable it is, the culture surrounding this software, and ~org-mode~.
If you don't know much about ~org-mode~, you can think of it as supercharged Markdown syntax that can also take care of tasks, projects, deadlines... it's great, really.
Don't got a lot to add, it's just nice.

** What is this file ?

Well, what you're reading right now is my, Arni's, literate ~org-mode~ configuration.
It can be broadly explained as literate programming, applied to configuration files which are quite a tradition in the Linux space.

But then... what is literate programming ? That sounds quite odd.

** What's literate programming ? And what are literate configurations, by extension ?

According to [[https://en.wikipedia.org/wiki/Literate_programming][Wikipedia]]...

#+begin_quote
"Literate programming is a programming paradigm introduced in 1984 by Donald Knuth in which a computer program is given as an explanation of how it works in a natural language, such as English, interspersed with snippets of macros and traditional source code, from which compilable source code can be generated. The approach is used in scientific computing and in data science routinely for reproducible research and open access purposes. Literate programming tools are used by millions of programmers today."
#+end_quote

So essentially, it is mixing human languages (such as English) and programming languages (such as Emacs Lisp) in a single source, in order to educate the programmer and user about what the program does, and how it does what it does. That is, if we even separate user and programmer here ;].

Considering all this, let us remind ourselves that a configuration file is useful in order to modify a software's behavior according to its user.
This way, the software is as close as possible to what the user wants their experience to be like.

We could think that the use of literate programming on configuration files is nice for a few reasons :

- Choices are extensively commented, anotated and described in the literate configuration file.
  This helps both the user and readers of the user's configuration in understanding which choices do what, and why the user made those choices.
- Better code organization. Using things such as ~org-mode~, we can cleanly organize snippets of code. This helps with code navigation, and for potential users to understand how everything is structured.
- Friendly interface, as opposed to raw source code.

Some may find other reasons, but those are ones that I relate to.

So to recap, literate programming is a concept that mixes human languages and programming languages.
Literate configurations are a way to apply this concept to configuration files.

** How does this specific literate configuration work ?

Based on Protesilaos Stavrou's literate configuration, this file generates the Elisp code that will be read by Emacs, instead of this file being some sort of dependency for my Emacs to launch.
I can then manually tangle the code in this file by calling ~org-babel-tangle~, bound to the =C-c C-v C-t= shortcut.

Well, now that we mentionned everything in the introduction, it would be a good time to talk about the code.
* On learning more about Emacs

Throughout this file, I will try to supply readers with an easy way to inform themselves on related Emacs features and to explain specific concepts.

In the [[*arni-literate-program][arni-literate-program]] heading, you can find an example of this where I provide a symbolic expression. Evaluating this symbolic expression will then send you to the Emacs manual.
I aim to do the same throughout this file, or provide useful links such as those from the [[https://www.emacswiki.org/][Emacs Wiki]].

If you're not sure of how to evaluate symbolic expressions in Emacs, here is a hopefully brief explanation.

Here's an example of a symbolic expression :

#+begin_example elisp
(info "(emacs) Top")
#+end_example

Note how things are kept inside of parentheses, which is symbolic (hah) of Lisp-like languages.

You can put the cursor on the last parenthesis of this symbolic expression, then call ~eval-last-sexp~.
You can do that either by calling it from =M-x=, which stands for ~execute-extended-command~, or call =C-x C-e= which calls ~eval-last-sexp~, assuming you haven't changed the default keybindings.
Once we evaluate it, we can see that we're sent to the top page of the Emacs manual, inside Emacs itself!

In ~org-mode~, you'll also see text which has special formatting, for things like web links. On my end, this special text is underlined and blue.
For those, which we can call buttons, we can call the =C-c C-o= shortcut for ~org-open-at-point~, which then calls an appropriate action. 
For web links, it will open the link under point inside of your Internet browser.

Throughout this file and throughout your use of Emacs, remember that you can search the Emacs manual to know more about Emacs's many features.
You can do so by calling =C-h r= which will send you to an Info buffer, presenting the Emacs manual.
Then, pressing =s= in this Info buffer will let you do a regular-expression search for a specific thing. Cool !
You can also use third-party packages like ~consult~ which, in my opinion, make searching in the manual a lot easier.

Finally, and this is moreso to learn the Emacs Lisp language...
But I recently came across this article : https://www.masteringemacs.org/article/emacs-builtin-elisp-cheat-sheet

If you call ~shortdoc-display-group~, you are given a choice between different groups.
And, these groups will contain Emacs Lisp functions for common tasks. It seems very handy whenever you're writing a function and need a refresher on something.

* The code

Here, I decided to organize my code into small, isolated files. I'll call them modules here.
This decision was inspired by how Protesilaos has organized his literate configuration.
This way, it is a lot easier to share the code to people who are interested without them relying on either Emacs or ~org-mode~.

** arni-literate-program
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-literate-program.el"
:END:

This module hosts utility code, that helps with frictionless use of literate programming.

#+begin_src elisp
  ;;; arni-literate-program.el
  ;; Setting the default safe variables

  (custom-set-variables
   '(safe-local-variable-values
     '((eval add-hook 'after-save-hook #'org-odt-export-to-odt nil 'local)
       (eval add-hook 'after-save-hook (lambda nil (org-babel-tangle))
  	   nil t))))
#+end_src

The above code will set Emacs' default safe local variables. Now uh, what are local variables ?
We can learn more about it by evaluating this symbolic expression :

#+begin_example elisp
(info "(emacs) Locals")
#+end_example

or by visiting the link here : https://www.gnu.org/software/emacs/manual/html_node/emacs/Locals.html.

We can infer that local variables are essentially variables specific to a given buffer.
This enables, for example, particular behavior for certain files and buffers.

** arni-package-manager
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-package-manager.el"
:END:

Emacs uses a package manager, in order to... manage... your packages.
Here, I customize it to fit my own needs.
As with many other package managers, it offers package searching, enabling different repositories, updates and such.

Another thing I'm fond of using for managing packages is ~use-package~. What's that ?
Not a package manager, but a macro! That is, a handy set of functions that help one configure their packages with just a few declarations.
You can evaluate this symbolic expression to read the use-package manual in Emacs :

#+begin_example elisp
(info "(use-package) Top")
#+end_example

or you can read [[https://github.com/jwiegley/use-package][its GitHub page]] and online user manual : https://www.gnu.org/software/emacs/manual/html_mono/use-package.html.

*But uhm, what are macros then?*

In Emacs Lisp, like all Lisps, macros are a way for the programmer to extend the language itself.
These macros take some Lisp code as input, and can create new Lisp code out of that.

As the Common Lisp documentation puts it... you could think of macros as functions that operate on code itself, rather than data as we're commonly used to (think Python, for example).

You can read up on [[https://lisp-docs.github.io/docs/tutorial/macros][the Common Lisp documentation of macros]] for further information.

*** ~package.el~, ~use-package.el~

#+begin_src elisp
  ;;; arni-package-manager.el
  ;;; Configure pacakge.el

  (require 'package)
  (setq package-install-upgrade-built-in t) ; Upgrade built-in packages along with manually-installed ones
  (add-to-list 'package-archives '("gnu"   . "https://elpa.gnu.org/packages/"))
  (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/"))
  (package-initialize)

  ;;; Make use-package install packages if they aren't

  (unless (package-installed-p 'use-package)
    (package-refresh-contents)
    (package-install 'use-package))

  (require 'use-package-ensure)
  (setq use-package-always-ensure t) ; Install packages if not installed and configured through use-package
  (setq package-check-signature nil)
#+end_src

Here, you should note a few important things.
First, the inclusion of :

#+begin_example elisp
(setq package-install-upgrade-built-in t)
#+end_example

When you install Emacs, you'll have many different packages pre-installed alongside it. A good example of this is ~org-mode~, which is installed without you needing to do anything to acquire it onto your system.

However, Emacs's default behavior is to /not/ upgrade those built-in packages, as opposed to upgrading other packages you've installed onto your system.
You can read [[http://yummymelon.com/devnull/updating-built-in-emacs-packages.html][this article from Charles Choi]] if you'd like to know more about this decision.

I'd personally prefer to have the latest libraries and packages available on Emacs, so I overwrote this behavior to upgrade all packages.

Now, about this bit of code :

#+begin_example elisp
(require 'use-package-ensure)
(setq use-package-always-ensure t)
#+end_example

Here, I modify the behaviour of ~use-package~ to always install packages if they are not currently installed. This makes it very simple for me to port my Emacs configuration over to other systems.

** arni-search
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-search.el"
:END:

Before including the code, I'd like to talk about searching for things in Emacs.. and in general.
The vast majority, if not all that we'll search for in Emacs will either /be/ text or be /represented by/ text.
So, it's good to keep in mind that when we search in Emacs, we look for the text associated with it.

Along with that, there are many different kinds of text we'll be searching for at any given moment.
If you write prose ; you could be looking for words, lines, paragraphs, specific words that could refer to something like a fictional character...
But if you write source code ; you'd instead look for symbolic expressions, function definitions, variables, conditionals, so on and so forth...

And finally, it's good to look into why we search for those things to begin with.

With prose, we could look for something if we forgot specific information we'd like to recall.
Maybe it's just to get one thing, out of a sea of text. Think of getting a recipe in the modern web hellscape. Stuff like that.
For source code, you could want to learn how a specific function works, get an overall understanding of a program, fix an error in the code...
In both cases, we look for a specific thing (likely thanks to the characters in the thing of interest) and do actions on it. Reading, editing, copying...

So for a small recap, we search for specific things in order to do actions on them. And the way we search for them is through text.

So uhm... what can we guess from that ?

We can think that depending on what we're doing, we could use different tools (or use the same tools differently), in order to reach what we want to reach faster.
A good example of this idea would be to modify ~isearch~'s behavior, depending on the major mode.
If we're in a text-derived mode or ~org-mode~, ~isearch~ could keep its usual behavior.
But, if we are in a programming-derived mode, we could make ~isearch~ look for specific texts related to programming.
So, we could imagine the ability to limit ~isearch~ candidates to variables, or function definitions, or... you get the idea. We could reduce the amount of search candidates, and therefore be more efficient in looking for specific things.

Some tools may also be more suited to specific tasks. ~occur~ would be better suited when you have a lot of search candidates, or you'd need an interactive way to look for and directly edit search candidates. Or, the famous ~avy~ package would let you quickly jump to specific and visible text.

I was tempted to add the ~dired~ package to this module, but I think this belongs to either its own module or in a module about my use of Emacs separate to text editing.

Now, let's include all the code, shall we ?

