arnimacs.org
*** ~isearch~ configuration

~isearch~ is one of Emacs's core tools. It lets you do an incremental search, and quickly jump to a given candidate.
I'll stay brief because you can quickly get complicated, but I invite you to read this manual page to learn its basics.

#+begin_example elisp
(info "(emacs) Basic Isearch")
#+end_example

or https://www.gnu.org/software/emacs/manual/html_node/emacs/Basic-Isearch.html...

And this page to learn about different customization options for ~isearch~ :

#+begin_example elisp
(info "(emacs) Search Customizations")
#+end_example

or https://www.gnu.org/software/emacs/manual/html_node/emacs/Search-Customizations.html.

In this block, I define functions I found, not made :^]. They'll be bound later in the next source block, which will contain the use-package declaration for ~isearch~.

#+begin_src elisp
  ;;; arni-search.el
  ;;; isearch
  ;; Function declarations

  ;; Taken from a Reddit post
  ;; https://www.reddit.com/r/emacs/comments/db8eu4/trying_to_collect_some_isearch_tips_and_tricks/

  (defun contrib/isearch-exit-at-front ()
      "always exit isearch, at the front of search match."
      (interactive)
      (isearch-exit)
      (when isearch-forward
        (goto-char isearch-other-end)))

  (defun contrib/isearch-exit-at-end ()
      "Always exit isearch, at the end of search match."
      (interactive)
      (isearch-exit)
      (when (not isearch-forward)
        (goto-char isearch-other-end)))

  ;; Taken from isearch+.el library
  ;; https://www.emacswiki.org/emacs/isearch%2b.el

  (defun contrib/isearchp-remove-failed-part-or-last-char ()
      "Remove failed part of search string, or last char if successful.
      Do nothing if search string is empty to start with."
      (interactive)
      (if (equal isearch-string "")
          (isearch-update)
        (if isearch-success
            (isearch-delete-char)
          (while (isearch-fail-pos) (isearch-pop-state)))
        (isearch-update)))
#+end_src

I have included the following two functions so that I would have more control over where the point is when I call ~isearch~. I can choose to be at the start of the ~isearch~ match, or to be at the end of this match.
Moreover, the third function is here to remove ALL of the failed part of the search string.

Here are some examples of these functions.

Say I have the search string 'ha' and this text :

#+begin_example text
Bob has many different laughs. Ha, heehee, and hoho !
#+end_example

Corny, but you get the point. Giving 'ha' to ~isearch~ will highlight all occurences of 'ha', here being in the words 'has' and 'Ha'.
I can go to the start of the first occurence, which will send me to the beginning of the word. I can also go to the end of the occurence, where the point will be between the 'a' and 's'.
With the second occurence, I can then go to either the start or end of the word, as 'Ha' is the entire case-insensitive candidate.

And if I give the search string 'hannah' to ~isearch~, its failed part will be 'nnah'. Instead of pressing backspace as many times as there are failed characters...
I should be able to press backspace ONCE, and all failed characters are removed. I'd be left with 'ha', and we'd be in the same situation as for the first explanation. Nice!

As for the use-package declaration...

#+begin_src elisp
  ;; use-package declaration
  (use-package isearch
    :ensure nil
    :init
    (setq isearch-repeat-on-direction-change	t ; no pause when switching between forward and backward search
          isearch-lax-whitespace			t
  	search-whitespace-regexp		".*"
  	isearch-lazy-count			t
  	isearch-allow-scroll			t ; can use C-v, M-v and others while in isearch to move in the buffer
  	isearch-wrap-pause			'no
  	lazy-highlight-initial-delay            0)
    :bind
     (:map					isearch-mode-map
     ("<return>"		.	contrib/isearch-exit-at-front)
     ("C-<return>"	.	contrib/isearch-exit-at-end)
     ("<backspace>"	.	contrib/isearchp-remove-failed-part-or-last-char)
     ("DEL"	        .	contrib/isearchp-remove-failed-part-or-last-char)))
#+end_src

*** ~occur~ configuration
Now, let's configure ~occur~.
If you'd like to learn more about ~occur~, you can check out this page from the manual.

#+begin_example elisp
(info "(emacs) Other Repeating Search")
#+end_example

Or, the web page at https://www.gnu.org/software/emacs/manual/html_node/emacs/Other-Repeating-Search.html.

It is essentially a tool that will display a list of matching search candidates, and let you do a ton of things with it.
Interactively visit search candidates, edit candidates from the Occur buffer, read the lines surrounding a given candidate...
Try it out ! And watch [[https://www.youtube.com/watch?v=zxS3zXwV0PU][Protesilaos's video on Occur]] if you'd like to learn more.

#+begin_src elisp
  ;;; occur
  ;; defining functions

  (defvar arni-occur-region-context-lines 0
    "The amount of context lines given to each match in 'arni/occur-region'.")

  (defun arni/occur-region (start end)
    "Start an Occur search on the current buffer, with current region as search query.
  This function does not support Occur's region narrowing."
    (interactive "r")
    (let ((regiontext (buffer-substring start end))
  	(contextlines arni-occur-region-context-lines))
      (occur regiontext contextlines nil)
      (deactivate-mark)))

  ;; use-package declaration

  (use-package isearch
    :ensure nil
    :demand t
    :init
    (setq list-matching-lines-default-context-lines 2) ; amount of lines shown around occur search candidates
    :bind
    ("<mouse-3>" . arni/occur-region)
    ("<down-mouse-3>" . arni/occur-region))
#+end_src

Seemingly no such thing as a built-in ~occur~ package exists, so I put its configuration inside of an ~isearch~ use-package declaration.
I also like to use the mouse for navigation, so I decided to make a DWIM command that lets me do an Occur search from selected text.
Lets me be faster, especially as I made a specific variable to dictate context lines for this specific command.

Note the inclusion of :

#+begin_example elisp
(setq list-matching-lines-default-context-lines 2)
#+end_example

which will increase the amount of lines that are shown around each candidate.
This is particularly useful in order to get more context for each candidate, and to edit around this candidate.
*** ~avy~ configuration (untangled)

~avy~ is a package that lets you jump to any visible charater, either in the currently focused buffer window,  or in the entire Emacs frame.
Sadly, there doesn't seem to be a manual page inside of Emacs for it. But, [[https://github.com/abo-abo/avy][its GitHub page]] should be enough to get you started.
It is quite customizable, and it can help you do some 'actions' from a distance as well.

I don't use those actions very often, but they can be very powerful if used correctly and often.
You can read [[https://karthinks.com/software/avy-can-do-anything/][this article from Karthik Chikmagalur]] to know more about it.

#+begin_src elisp :tangle no
  ;;; avy
  ;; use-package declaration

  (use-package avy
    :init
    (setq avy-background		t ; background becomes grey, simpler to see candidates
  	avy-styles-alist	'((avy-goto-char-timer . at-full))
  	avy-keys		'(?q ?s ?d ?f ?j ?k ?l ?m)
  	avy-timeout-seconds	0.7 ; press enter to directly jump to candidates
  	avy-all-windows		nil) ; avy only acts on the currently focused buffer window for fewer candidates
    :config
    (advice-add 'avy-action-goto :after 'pulse-momentary-highlight-one-line)
    (setf (alist-get ?\C-y        avy-dispatch-alist) 'avy-action-yank 
  	(alist-get ?\C-c	avy-dispatch-alist) 'avy-action-copy 
  	(alist-get ?\C-k	avy-dispatch-alist) 'avy-action-kill-move
  	(alist-get ?\C-z	avy-dispatch-alist) 'avy-action-zap-to-char
  	(alist-get ?\C-t	avy-dispatch-alist) 'avy-action-teleport
  	(alist-get ?\C-h	avy-dispatch-alist) 'avy-action-helpful)
    :bind
    (("C-j" . avy-goto-word-1) ;; i would love to have avy goto word 2
     :map	org-mode-map
     ("C-j" . avy-goto-word-1)
     :map isearch-mode-map
     ("C-j" . avy-isearch)))
#+end_src

A small note, I prefer binding Avy actions to modifier keys, so it doesn't get in the way of avy-keys.

*** ~consult~ configuration

~consult~ is, in my eyes, a wonderful package that many people should know about.
It's essentially a package that can show you the results of a given search.

If you've used ~isearch~, you can see how, when you scroll through candidates in a buffer, your screen jumps to said candidate.
Imagine that this idea of showing the candidate and surrounding context is extended to many other search commands.

Searching for 'man' or Info manuals in Emacs, 'grep'-ing things in folders... plenty of things.
Feel free to read [[https://github.com/minad/consult][its GitHub page]] to know more.

#+begin_src elisp
  (use-package consult
    :bind
    (("C-x b" . consult-buffer)))
#+end_src

*** ~eww~ configuration

~eww~ is the Emacs Web Wowzer. Or alternatively, a web browser inside of Emacs.
It's very extensible and does integrate with things like ~org-mode~, with functions such as ~org-eww-copy-for-org-mode~ that can transform the current Eww buffer into an Org buffer.

To know some more about Eww, you can evaluate this symbolic expression :

#+begin_example elisp
(info "(eww)Top")
#+end_example

or go to this page : https://www.gnu.org/software/emacs/manual/html_node/eww/index.html.

Here's my short configuration of ~eww~ !

#+begin_src elisp
  ;;; eww
  ;; use-package declaration
  (use-package eww
    :init
    (add-hook 'eww-after-render-hook 'visual-line-mode)
    (add-hook 'eww-mode-hook
  	    (lambda ()
  	      (setq-local tab-line-tabs-function 'tab-line-tabs-mode-buffers)
  	      (tab-line-mode 1)))
    :config
    (setq eww-auto-rename-buffer t
  	eww-buffer-name-length 20)
    :bind
    (("C-c e" . eww)
     :map eww-mode-map
     ("o" . org-eww-copy-for-org-mode)))
#+end_src

I have also modified the ~tab-line-mode~ here, to fit my own needs.
I always use the ~tab-bar-mode~, but see myself only wanting the ~tab-line-mode~ whenever using Eww.
This way, I can get browser tabs similar to modern web browsers, like Firefox.
To do this, I make a hook that sets a buffer-local variable only on Eww buffers.
Then, the ~tab-line-mode~ is activated in only these Eww buffers.
That way, this configuration applies only to Eww buffers and will not interfere with ~tab-line-mode~ for other things, were I to use it more often.

If you are curious about what ~tab-line-mode~ is, you can look at this Info node :
#+begin_example elisp
(info "(emacs) Tab Line")
#+end_example
or refer to the web link at https://www.gnu.org/software/emacs/manual/html_node/emacs/Tab-Line.html.

You may have also seen this bit of code :
#+begin_example elisp
(setq eww-auto-rename-buffer t)
#+end_example

This simply will rename the Eww buffer to the name of the page, upon refreshing the buffer.
This is very nice along with my previous ~tab-line-mode~ configuration.

