arnimacs.org
*** ~view-mode~ configuration

I've been playing around with ~view-mode~ recently. I like the idea a lot, and it serves as a nice navigation mode not unlike what Vim has.
But, I don't like its defaults keybindings at all so I thought I would remake them.

If you are curious about this mode, you can refer to the Emacs manual page over at...

#+begin_example elisp
(info "(emacs) View Mode")
#+end_example

or on the internet at https://www.gnu.org/software/emacs/manual/html_node/emacs/View-Mode.html.

Here's my little configuration now.

#+begin_src elisp
  ;;; view-mode
  ;; rebinding keys

  (defvar-keymap arni-view-mode-mark-map
    :doc "Keymap for nesting mark-related commands in 'arni-view-mode-map'."
    :repeat t
    "s"		#'point-to-register ;; mark save
    "j"		#'register-to-point ;; mark jump
    "p"		#'View-back-to-mark ;; mark pop
    "m"		#'set-mark-command)

  (defvar-keymap arni-view-mode-map
    :doc "Personal keymap for my preferred 'view-mode' keybindings."
    :repeat nil
    "/"		#'View-search-regexp-forward
    "f"		#'View-search-last-regexp-forward ;; forward and backward matches
    "b"		#'View-search-last-regexp-backward
    "e"		#'View-exit ;; quit mode. could be bound to g, e or q
    "n"		#'View-scroll-half-page-forward ;; next and previous pages (think the line commands)
    "p"		#'View-scroll-half-page-backward
    "SPC"	        #'View-scroll-page-forward ;; spc and s-spc rebound depending on majmode
    "S-SPC"	#'View-scroll-page-backward
    "j"		#'avy-goto-char-timer ;; jump
    "m"		arni-view-mode-mark-map
    "x"		#'exchange-point-and-mark
    "%"		#'View-goto-percent ;; go to end or specific percentage of buffer
    "("		#'beginning-of-buffer
    ")"		#'end-of-buffer
    "="		#'what-line
    "g"		#'View-goto-line
    "-"		#'negative-argument
    "9"		#'digit-argument
    "8"		#'digit-argument
    "7"		#'digit-argument
    "6"		#'digit-argument
    "5"		#'digit-argument
    "4"		#'digit-argument
    "3"		#'digit-argument
    "2"		#'digit-argument
    "1"		#'digit-argument
    "0"		#'digit-argument)

  (setq view-mode-map arni-view-mode-map)
#+end_src

*** ~imenu~ configuration

~imenu~ is a facility that lets you quickly jump to "major definitions", in a buffer.
These definitions can be things like function definitions for programming languages.
They can also be chapter sections for text major modes.

Here are some of my personal configurations.

#+begin_src elisp
  ;;; imenu
  ;; use-package

  (use-package emacs
    :config
    (setq imenu-flatten t
  	imenu-level-separator ": "
  	imenu-space-replacement " "
  	imenu-auto-rescan t
  	imenu-max-item-length 160))
#+end_src

*** Supplementing the ~search-map~ keymap

Emacs already provides a keymap for extensive searching. By default, this keymap is bound to =M-s=.
I also decided to supplement it with many other commands, so that it would be easier for me to call some functions I'd be using.  

#+begin_src elisp
  ;;; Defining and supplementing search-map
  (defvar-keymap arni-apropos-map
    :doc "Personal keymap to nest 'apropos' commands."
    "a" #'apropos
    "d" #'apropos-documentation
    "u" #'apropos-user-option
    "c" #'apropos-command
    "f" #'apropos-function
    "v" #'apropos-variable
    "l" #'apropos-local-variable
    "C-v" #'apropos-value
    "C-l" #'apropos-local-value
    "M-l" #'apropos-library)

  (define-key search-map (kbd "a") arni-apropos-map)
  (define-key search-map (kbd "g") 'consult-ripgrep)
  (define-key search-map (kbd "i") 'consult-info)
  (define-key search-map (kbd "m") 'consult-imenu)
  (define-key search-map (kbd "e") 'eww)
  (define-key search-map (kbd "C-o") 'consult-outline)
  (define-key search-map (kbd "s") 'shortdoc-display-group)
#+end_src

** arni-keys
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-keys.el"
:END:

Here, this module keeps all code related to keybinding helpers, small utility packages like ~which-key~ and ~repeat-mode~ configurations. Moreover, some global keybindings that wouldn't really belong to other modules.
An example of this would be binding C-n, C-p and other movement commands to other functions.

*** Talking about keybinding paradigms, and how I see efficiency / physical ergonomics for text editing

Initially I wrote an entire yap session, but I don't think most people would want that !
So, I just took my conclusions and left them here.
If you're interested in the reasoning or experiences behind all this, then feel free to ask me!

If your fingers get uncomfy seeking even one or a handful of keys on your keyboard... maybe it's your keyboard that should be looked into? Or your keyboard layout?
If you're deeply concerned about RSI like I am, or just health-conscious... I don't think modal VS modeless editing is the right question.
It is a lot better to talk about things like which keyboard you use, the keyboard layout, or even software modifications like adding home row keys with /keyd/.
Using a [[https://github.com/davidphilipbarr/Sweep][Ferris Sweep]] with the [[https://colemak.com/][Colemak]] layout, as well as taking regular breaks and investing in an adjustable chair make a lot more sense if you're looking to fix RSI than the endless cycle of "hey I wanna change my keybinds!".

Before actually inserting the code, I do want to add this Org table I had in my previous literate configuration.
It has a bunch of links for different Emacs keybind packages like the ones I previously described.

| Practice                          | Resources and documents                                                                                  |
|-----------------------------------+----------------------------------------------------------------------------------------------------------|
| Good keyboard                     | https://www.ecosia.org/search?q=ergonomic%20keyboards&addon=firefox&addonversion=5.2.0&method=topbar     |
| Using sticky keys                 | https://www.emacswiki.org/emacs/StickyModifiers                                                          |
|                                   | http://xahlee.info/kbd/sticky_key.html                                                                   |
| Key chords, sequences...          | http://xahlee.info/kbd/banish_key_chords.html                                                            |
|                                   | https://www.emacswiki.org/emacs/key-chord.el (not the key chording Xah talks about!)                     |
| "Science" of command efficiency   | http://xahlee.info/emacs/emacs/science_of_command_efficiency.html                                        |
| Keybinding paradigms and packages | https://github.com/meow-edit/meow                                                                        |
|                                   | https://github.com/xahlee/xah-fly-keys                                                                   |
|                                   | https://github.com/emacsorphanage/key-chord                                                              |
|                                   | https://github.com/vlevit/key-seq.el (fork of key-chord where the order of keys matters)                 |
|                                   | https://github.com/emacsorphanage/god-mode                                                               |
|                                   | https://github.com/susam/devil (half-modal, big fan of it and its idea of modal BNPF)                    |
|                                   | https://www.emacswiki.org/emacs/OneKey (convenient way to find keybinds, like an interactible which-key) |
|                                   | https://elpa.gnu.org/packages/which-key.html                                                             |

If there's some unsollicited advice I can give you, you REALLY should set up home-row mods or sticky keys for your entire system.
Look into software like KMonad which is available for Linux, MacOS and Windows. Well you should always use Linux, but...
keyd is another one I really like but it's only on Linux.

*** ~repeat-mode~ configuration

~repeat-mode~ is a great addition in Emacs, which lets you do away with repeating the prefix key of something, or just forgo the calling of a modifier key for certain uses.
It's ideal for comfort and for efficiency, especially when it comes to more involved keybinds involving one or more prefixes.
For example, this goes for things like =C-x o= for ~other-window~ or =C-c @ C-M-h= for ~hs-hide-all with hs-minor-mode enabled~.

Here's an example of how one could apply and change repeat defintions to specific keymaps, taken from [[https://zck.org/emacs-repeat-mode-emacs-repeat-mode][this zck.org article]] :

#+begin_example elisp
  (defvar change-of-case-keymap
    (define-keymap
      "c" #'capitalize-dwim
      "d" #'downcase-dwim
      "u" #'upcase-dwim))

  (put #'capitalize-dwim 'repeat-map 'change-of-case-keymap)
  (put #'downcase-dwim 'repeat-map 'change-of-case-keymap)
  (put #'upcase-dwim 'repeat-map 'change-of-case-keymap)

  (global-set-key (kbd "M-c") 'capitalize-dwim) ;; run M-c, then look at the minibuffer informing you of the current repeat map
#+end_example

Now, here's my ~repeat-mode~ configuration :

#+begin_src elisp
  ;;; repeat-mode
  ;; use-package declaration
  
  (use-package repeat
    :ensure nil
    :config
    (setq repeat-on-final-keystroke t
  	repeat-exit-timeout 5
  	repeat-exit-key "<escape>"
  	repeat-keep-prefix nil
  	repeat-check-key t
  	set-mark-command-repeat-pop t))
#+end_src

*** ~which-key~ configuration

~which-key~ will display the next possible keybinds you can input when inside of a keymap, on the minibuffer. Since Emacs keybindings are so dense, this is incredibly useful, especially with major modes that have tons of keybinds such as ~org-mode~.

Some other ideas to know keybindings are to look at major mode cheatsheets, or to call ~describe-keymap~ for the keymap of interest.
The latter function isn't bound to any keybind by default, so you can bind it yourself or call it with =M-x=.
It's also possible to call =C-h= when in the middle of a shortcut, which will make you jump to the Help buffer of the current keympap you're in.

#+begin_src elisp
  ;;; which-key
  ;; use-package declaration
  
  (use-package which-key
    :config
    (setq which-key-idle-delay 0.4)
    (which-key-mode 1))
#+end_src

** arni-dired
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-dired.el"
:END:

~dired~ is a directory editor, made inside of Emacs.
I find it extremely handy, as you can do all the usual commands that Emacs provides.
Alongside that, it's very programmable and is more flexible than any other file manager out there, if you learn what it can do.

Some QoL features of ~dired~ include an easy access to standard file management, replicating things like ~cp~, ~mv~, ~chmod~ and so on.
You can also mark multiple files to do the same operations on them at once, bulk rename them, only showing files and directories you're interested in, running macros...
There's just a lot, right. It's an Emacs tool after all!

If you wanna learn more, visit the related Info page by evaluating this symbolic expression :

#+begin_example elisp
(info "(emacs) Dired")
#+end_example

or look at the web page of the manual at https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html.

Here, I use multiple packages to supplement Dired. Mostly, it's ~dired-preview~ and ~nerd-icons-dired~.
Now... let's get into the code.

*** ~dired-preview~ configuration
~dired-preview~ is a package that lets you... preview files, obivously, when your cursor is onto a specific file.
You can easily turn it on and off, as it's a toggleable minor mode that acts on Dired's behavior.

For documentation on ~dired-preview~, you can evaluate this symbolic expression !

#+begin_example elisp
(info "(dired-preview) Top")
#+end_example

And you can find its GitHub page here : https://github.com/protesilaos/dired-preview

#+begin_src elisp
  ;;; arni-dired
  ;;; dired-preview
  ;; use-package declaration

  (use-package dired-preview
    :init
    (setq dired-preview-delay 0.6
  	  dired-preview-max-size (expt 2 20))
    (setq dired-preview-ignored-extensions-regexp
          (concat "\\."
                  "\\(gz\\|"
                  "zst\\|"
                  "tar\\|"
                  "xz\\|"
                  "rar\\|"
                  "zip\\|"
                  "iso\\|"
  		"AppImage\\|"
                  "epub"
                  "\\)"))
    :bind
    ("C-x M-p" . dired-preview-global-mode))
#+end_src

