arnimacs-modules/arni-dired.el
;;; arni-dired
;;; dired-preview
;; use-package declaration

(use-package dired-preview
  :init
  (setq dired-preview-delay 0.6
	  dired-preview-max-size (expt 2 20))
  (setq dired-preview-ignored-extensions-regexp
        (concat "\\."
                "\\(gz\\|"
                "zst\\|"
                "tar\\|"
                "xz\\|"
                "rar\\|"
                "zip\\|"
                "iso\\|"
		"AppImage\\|"
                "epub"
                "\\)"))
  :bind
  ("C-x M-p" . dired-preview-global-mode))

;;; dired
;; function definitions
