arnimacs-modules/arni-search.el

(defvar-keymap arni-view-mode-mark-map
  :doc "Keymap for nesting mark-related commands in 'arni-view-mode-map'."
  :repeat t
  "s"		#'point-to-register ;; mark save
  "j"		#'register-to-point ;; mark jump
  "p"		#'View-back-to-mark ;; mark pop
  "m"		#'set-mark-command)

(defvar-keymap arni-view-mode-map
  :doc "Personal keymap for my preferred 'view-mode' keybindings."
  :repeat nil
  "/"		#'View-search-regexp-forward
  "f"		#'View-search-last-regexp-forward ;; forward and backward matches
  "b"		#'View-search-last-regexp-backward
  "e"		#'View-exit ;; quit mode. could be bound to g, e or q
  "n"		#'View-scroll-half-page-forward ;; next and previous pages (think the line commands)
  "p"		#'View-scroll-half-page-backward
  "SPC"	        #'View-scroll-page-forward ;; spc and s-spc rebound depending on majmode
  "S-SPC"	#'View-scroll-page-backward
  "j"		#'avy-goto-char-timer ;; jump
  "m"		arni-view-mode-mark-map
  "x"		#'exchange-point-and-mark
  "%"		#'View-goto-percent ;; go to end or specific percentage of buffer
  "("		#'beginning-of-buffer
  ")"		#'end-of-buffer
  "="		#'what-line
  "g"		#'View-goto-line
  "-"		#'negative-argument
  "9"		#'digit-argument
  "8"		#'digit-argument
  "7"		#'digit-argument
  "6"		#'digit-argument
  "5"		#'digit-argument
  "4"		#'digit-argument
  "3"		#'digit-argument
  "2"		#'digit-argument
  "1"		#'digit-argument
  "0"		#'digit-argument)

(setq view-mode-map arni-view-mode-map)

;;; imenu
;; use-package

(use-package emacs
  :config
  (setq imenu-flatten t
	imenu-level-separator ": "
	imenu-space-replacement " "
	imenu-auto-rescan t
	imenu-max-item-length 160))

;;; Defining and supplementing search-map
(defvar-keymap arni-apropos-map
  :doc "Personal keymap to nest 'apropos' commands."
  "a" #'apropos
  "d" #'apropos-documentation
  "u" #'apropos-user-option
  "c" #'apropos-command
  "f" #'apropos-function
  "v" #'apropos-variable
  "l" #'apropos-local-variable
  "C-v" #'apropos-value
  "C-l" #'apropos-local-value
  "M-l" #'apropos-library)

(define-key search-map (kbd "a") arni-apropos-map)
(define-key search-map (kbd "g") 'consult-ripgrep)
(define-key search-map (kbd "i") 'consult-info)
(define-key search-map (kbd "m") 'consult-imenu)
(define-key search-map (kbd "e") 'eww)
(define-key search-map (kbd "C-o") 'consult-outline)
(define-key search-map (kbd "s") 'shortdoc-display-group)
