arnimacs.org
*** ~dired~ configuration

Now that we set up those packages, let's look into configuring ~dired~ itself.

Again, you can document yourself on Dired by visiting its Info manual page.

#+begin_example elisp
(info "(emacs) Dired")
#+end_example

or the web page at https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired.html.

#+begin_src elisp
  ;;; dired
  ;; function definitions

  (defun arni/diredpretties-hook()
    (dired-hide-details-mode 1)	;; Hiding details like file permissions
    (hl-line-mode 1) ;; line highlighted
    (dired-omit-mode 1))

  (defun arni/dwim-dired-find-file (arg)
    "When called alone, calls dired.
  But when called with ARG, like C-u, calls rgrep."
    (interactive "P")
    (if arg
        (call-interactively 'rgrep)
      (call-interactively 'dired)))

  ;; use-package declarations

  (use-package dired
    :ensure nil
    :demand t
    :init
    (require 'dired-x)
    (add-hook 'dired-mode-hook 'arni/diredpretties-hook)
    (setq dired-omit-files		"^\\.?#\\|^\\.$\\|^\\.\\.$\\|^\\..*$"      ;; Bound to C-x M-o (dired-omit-mode) in dired-mode-map, by default
        dired-dwim-target			t
        dired-auto-revert-buffer		t
        delete-by-moving-to-trash		t
        trash-directory			"~/.local.share/Trash/files/"
        dired-listing-switches		"-alh --group-directories-first"
        dired-create-destination-dirs	'ask
        dired-guess-shell-alist-user	'(("\\.mkv\\'" "vlc"))
        dired-clean-up-buffers-too        nil)
    :bind
    (("C-x M-h" . dired-hide-details-mode)
     :map dired-mode-map
     ("b" . dired-up-directory)
     ("s" . arni/dwim-dired-find-file)
     ("<TAB>" . dired-subtree-toggle)
     ("<mouse-2>" . dired-mouse-find-file))) ;; opens in new window by default, dont like it
#+end_src

Some things that I think are noteworthy are ~delete-by-moving-to-trash~, ~dired-listing-switches~ and ~dired-dwim-target~.

~delete-by-moving-to-trash~ is a variable which says whether files deleted by Emacs should be fully deleted or instead moved to a Trash folder. It meshes well with the ~trash-directory~ variable which specifies what this Trash folder should be.
These two variables affect ~delete-file~, ~delete-directory~ and Dired deletion commands.

Go to this manual page for more information on miscellaneous file operations like those for Trash folders :

#+begin_example elisp
(info "(emacs) Misc File Ops")
#+end_example
its web page being at https://www.gnu.org/software//emacs/manual/html_node/emacs/Misc-File-Ops.html.

And, this page for more information on deleting files with ~dired~ :

#+begin_example elisp
(info "(emacs) Dired Deletion")
#+end_example
also readable here : https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired-Deletion.html.

Now, the way that ~dired~ obtains its output is from ~ls~, the Linux CLI tool.
Therefore, we can modify its output by modifying which arguments it calls when using ~ls~.
~dired-listing-switches~ is therefore the arguments to pass to ~ls~, in order to have the desired Dired output.

Finally... when you work with Dired, and if you enjoy the workflow that CLI tools like Midnight Commander provide, you may use multiple panes to manage files.
And, for example, you may want to move or copy a bunch of marked files to another folder, the latter one being the folder shown in the other pane. Generally, when you're being prompted for a directory to do actions on.
To automatically suggest the directory of the other pane, you can use the ~dired-dwim-target~ and set it to non-‘nil’.
I think it's very handy!

There are some more tidbits about this variable which you can read at :

#+begin_example elisp
(info "(emacs) Operating on Files")
#+end_example
or at https://www.gnu.org/software/emacs/manual/html_node/emacs/Operating-on-Files.html.

Also, a thing I just learned while writing this !
Reading the "(emacs) Dired Enter" page and a Reddit post, I found that you can make Dired only list files that match a particular pattern starting from a directory.

#+begin_example elisp
(info "(emacs) Dired Enter")
#+end_example
readable at https://www.gnu.org/software/emacs/manual/html_node/emacs/Dired-Enter.html.

It sounds very nice, as a way to conveniently limit the files to only interesting things.
Assuming you are on Linux or otherwise have a filesystem following its convetions, here's an example :

1) Only listing .png files in the ~dired~ buffer of the '~/Pictures' folder.
2) The same, either directly inside this folder, or in any of its subfolders.
  
#+begin_example elisp
(dired "~/Pictures/*.png")
(dired "~/Pictures/*/*.png")
#+end_example

I also decided to make a nice utility : when ~dired~ sees I'm in the trash directory, the ~delete-by-moving-to-trash~ variable is set to nil on this buffer.

#+begin_src elisp
  ;;; dired trash utility

  (with-eval-after-load 'dired
    (add-hook 'dired-after-readin-hook
    	    (lambda ()
    	      (if (equal (dired-current-directory) "/home/arni/.local.share/Trash/files/") ;; dont use eq !
    		  (progn
      		    (setq-local delete-by-moving-to-trash nil)
    		    (highlight-regexp "/home/arni/.local.share/Trash/files" 'hi-pink)
    		    (message "Files will be fully deleted here!"))
    		(ignore)))))
#+end_src

I didn't see much of a point in making it into a function, so it's just a lambda function.

** arni-org
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-org.el"
:END:

~org-mode~ is one of the most famous Emacs major modes.
It can be quickly described as a supercharge Markdown format which can help you in your daily life.
Whether you're a writer, programmer, average Joe... it's really nice.

But what can ~org-mode~ do? And why do I use it?

Well, it can be just a formatting syntax, like Markdown.
Hyperlinks, text formatting, headings... the usual, really.
However, ~org-mode~ is capable of much more.
You can easily write entire documents and easily export them to different formats : iCal, HTML, LaTeX and PDF, ODT, Markdown, simple plain text...
And of course, you can extend it to export to more formats if needed.
You can add tons of metadata in headings, from stuff like TODO states to scheduling, specific tags, specific properties...

Using this metadata, you can then ask ~org-mode~ to resurface specific headings and their contents. ~org-agenda~ is a notable tool for this!
~org-mode~ also makes literate programming very easy, as you can mix formatting syntax and code segments that work.
Then, you can send the contents of multiple code blocks to specific files.
It's what makes this document possible in the first place!

Finally, it has many utilities to help you with daily calendaring, personal knowledge management, time tracking, planning, project management and... you get the idea.

To me, it's essentially a powerhouse for my life and to organize everything. I remember kinda stumbling about, switching PKM tools to help myself in my daily life and to stay on top of things. ~org-mode~ stopped me from jumping everywhere.

To know more about ~org-mode~, you can look at the ~org-mode~ manual and its website.

The website can be found here : https://orgmode.org/
And to access the manual, you can either look at it from their website at https://orgmode.org/manuals.html...

Or, especially if you know how to navigate in Emacs, you can read it inside Emacs :

#+begin_example elisp
(info "(org) Top")
(info "(org) Features Overview")
#+end_example

Now... let's look into the configurations !

*** general ~org-mode~ configuration

#+begin_src elisp
  ;;; arni-org
  ;;; configuring general options of org-mode

  (use-package org
    :init
    (setq org-todo-keywords
          '((sequence "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
    (setq org-startup-folded		'content
  	  org-use-speed-commands	t
  	  org-refile-targets		'((nil :maxlevel		.	3)
  					  (org-agenda-files :maxlevel	.	3))
  	  org-ellipsis			" ▼"
  	  org-fontify-todo-headline     nil
  	  org-fontify-done-headline     nil
  	  org-insert-heading-respect-content t)
    (require 'ox-md) ; org → markdown export
    :hook
    (org-mode . org-indent-mode)
    :bind
    (("C-c c" . org-capture)
     ("C-c a" . org-agenda)
     ("C-c l" . org-store-link)
     :map org-mode-map
     ("C-," . nil)))    
#+end_src

Here, I define things that should be relevant to most or all Org files I'll use.
I think most options are self-explanatory, but I'd like to talk a bit about the speed commands.

When your cursor is on the stars that define a heading (*), you have the possibility of using ~org-mode~'s speed commands.
These let you type a single letter, and have each letter do a different action.
=n= would jump to the next visible heading and =p= to the previous visible heading.
=j= would call ~org-goto~, which lets you search for headings very efficiently. =c= lets you cycle visibility of headings, and so on.
It's super handy once you get the hang of it.

You can go to its manual page to learn more :

#+begin_example elisp
(info "(org) Speed Keys")
#+end_example
or look at the page here : https://orgmode.org/manual/Speed-Keys.html.

You also notice letters in parentheses, next to the defined TODO state keywords.
From https://emacslife.com/baby-steps-org.html, I found out that it lets you directly set the wanted state with C-c C-t [letter].
I prefer that as opposed to spamming C-c C-t.

*** ~org-babel~

~org-babel~ is the part of ~org-mode~ that lets you write code blocks inside of Org buffers and manipulate those blocks.
Tangling to different files, evaluating the contents of said block and so on.

You can go to this page for, to read a ton about it :

#+begin_example elisp
(info "(org) Working with Source Code")
#+end_example
or go to the online version of the site, available at https://orgmode.org/manual/Working-with-Source-Code.html.

For this configuration, the two things I modify are the functions I use for Common Lisp programming and which languages are loaded for source blocks.
I don't have much to add on that front.

Now for the configuration :

#+begin_src elisp
  ;;; org-babel

  (use-package org
    :init
    (setq org-babel-lisp-eval-fn 'sly-eval)
    (setq org-babel-python-command "python3")
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((python . t)
       (emacs-lisp . t)
       (shell . t)
       (lisp . t))))
#+end_src

