arnimacs-modules/arni-org.el
;;; arni-org
;;; configuring general options of org-mode

(use-package org
  :init
  (setq org-todo-keywords
        '((sequence "TODO(t)" "IN-PROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")))
  (setq org-startup-folded		'content
	  org-use-speed-commands	t
	  org-refile-targets		'((nil :maxlevel		.	3)
					  (org-agenda-files :maxlevel	.	3))
	  org-ellipsis			" ▼"
	  org-fontify-todo-headline     nil
	  org-fontify-done-headline     nil
	  org-insert-heading-respect-content t)
  (require 'ox-md) ; org → markdown export
  :hook
  (org-mode . org-indent-mode)
  :bind
  (("C-c c" . org-capture)
   ("C-c a" . org-agenda)
   ("C-c l" . org-store-link)
   :map org-mode-map
   ("C-," . nil)))

;;; org-babel

(use-package org
  :init
  (setq org-babel-lisp-eval-fn 'sly-eval)
  (setq org-babel-python-command "python3")
  (org-babel-do-load-languages
   'org-babel-load-languages
   '((python . t)
     (emacs-lisp . t)
     (shell . t)
     (lisp . t))))
