arnimacs.org
*** ~org-agenda~ and refiling

~org-agenda~ is a way to view specific headings, according to some search terms you can define yourself.
It is commonly used to check TODO items for the current day / week, or to look at headings that are of particular interest.
You could, for example, pull up all headings in a given Org file that contain the word "recipe" or that have the "programming" tag.
A small caveat is that you have to specify the files or folders that are taken into account when building this agenda view, as it won't take every Org file you've made in your computing life (by default, at least).
I love it to bits and it's what helps with project management.

Another tool that integrates very well is ~org-capture~. Essentially, you can call a keybind that will let you write whatever, starting from a template of your choosing.
An example of its usage would be this : imagine you're programming, and realize there's something you have to do later.
A frictionless way to do this would be do call ~org-capture~, then choose the default TODO template and write whatever it is you need to write. Once you're done, you can refile the written TODO item in a given file.

Like usual, here is the manual page to read up on ~org-agenda~ :

#+begin_example elisp
(info "(org) Agenda Views")
#+end_example
or https://orgmode.org/manual/Agenda-Views.html...

and the page for ~org-capture~ :

#+begin_example elisp
(info "(org) Capture")
#+end_example
or at https://orgmode.org/manual/Capture.html.

You can also call the ~org-agenda~ and ~org-capture~ commands to see how they behave :

#+begin_example elisp
(org-agenda)
(org-capture)
#+end_example

Now, here's my configuration !

#+begin_src elisp
  ;;; org-agenda configuration

  (use-package org
    :init
    (defun arni/org-agenda-wm-call ()
      (interactive)
      (org-agenda :keys "a")
      (delete-other-windows))
    (setq org-agenda-files	'("~/org/refile.org")
  	org-default-notes-file	"~/org/refile.org")
    (setq org-capture-templates
            '(("t" "Task" entry (file+headline "~/org/refile.org" "Tasks")
               "* TODO %? :task:\nEntered on %T\n %i\n %a")
              ("n" "Notes" entry (file+headline "~/org/refile.org" "Notes")
               "* %? :notes:\nEntered on %T\n %i %a\n** Context")
              ("r" "Reflection" entry (file+headline "~/org/refile.org" "Reflections")
               "* %? :reflection:\nEntered on %T\n %i %a\n** Context")
              ("p" "Project" entry (file+headline "~/org/refile.org" "Projects")
               "* %? :project:\nEntered on %T\n %i %a\n** Context")
              ("R" "Recipe" entry (file+headline "~/org/refile.org" "Recipes")
               "* %? :recipe:\nEntered on %T\n %i\n %a")
              ("i" "Idea" entry (file+headline "~/org/refile.org" "Ideas")
               "* %? :idea:\nEntered on %T\n %i\n %a")
  	    ("m" "Mini-essay" entry (file+headline "~/org/refile.org" "Mini-Essays")
               "* %? :mini-essay:\nEntered on %T\n %i\n %a")
  	    ("c" "Creative Writing" entry (file+headline "~/org/refile.org" "Creative Writing")
               "* %? :creative:\nEntered on %T\n %i %a\n** Thoughts and reflections")))
    (setq org-agenda-custom-commands
  	'(
            ;; Existing custom commands
            ("n" "Notes" tags "notes"
             ((org-agenda-overriding-header "Notes")
              (org-agenda-files '("~/org/refile.org"))
              (org-agenda-skip-function
               '(org-agenda-skip-entry-if 'notregexp ":notes:$"))))
            ("t" "Tasks" tags "task"
             ((org-agenda-overriding-header "Tasks")
              (org-agenda-files '("~/org/refile.org"))
              (org-agenda-skip-function
               '(org-agenda-skip-entry-if 'notregexp ":task:$"))))
            ("r" "Reflections" tags "reflection"
             ((org-agenda-overriding-header "Reflections")
              (org-agenda-files '("~/org/refile.org"))
              (org-agenda-skip-function
               '(org-agenda-skip-entry-if 'notregexp ":reflection:$"))))
            ("p" "Projects" tags "project"
             ((org-agenda-overriding-header "Projects")
              (org-agenda-files '("~/org/refile.org"))
              (org-agenda-skip-function
               '(org-agenda-skip-entry-if 'notregexp ":project:$"))))
            ("R" "Recipes" tags "recipe"
             ((org-agenda-overriding-header "Recipes")
              (org-agenda-files '("~/org/refile.org"))
              (org-agenda-skip-function
               '(org-agenda-skip-entry-if 'notregexp ":recipe:$"))))
            ("i" "Ideas" tags "idea"
             ((org-agenda-overriding-header "Ideas")
              (org-agenda-files '("~/org/refile.org"))
              (org-agenda-skip-function
               '(org-agenda-skip-entry-if 'notregexp ":idea:$"))))

            ;; New custom commands
            ("w" "Captures from last week"
             ((agenda ""
                      ((org-agenda-start-day "-7d")
                       (org-agenda-span 7)
                       (org-agenda-start-on-weekday nil)
                       (org-agenda-start-with-log-mode t)
                       (org-agenda-skip-function
                        '(org-agenda-skip-entry-if 'nottodo 'done))))))

            ("d" "Deadlines in next two weeks"
             ((agenda ""
                      ((org-agenda-time-grid nil)
                       (org-deadline-warning-days 14)
                       (org-agenda-entry-types '(:deadline))
                       (org-agenda-span 14)
                       (org-agenda-start-on-weekday nil)))))

            ("s" "Scheduled tasks for next week"
             ((agenda ""
                      ((org-agenda-entry-types '(:scheduled))
                       (org-agenda-span 7)
                       (org-agenda-start-on-weekday nil))))))))
#+end_src

Here, the ~org-capture-templates~ variable is there to give me multiple templates to call when I'm calling ~org-capture~.
And, ~org-agenda-custom-commands~ is there to give me different Agenda views I can use to resurface specific headings.
You may also notice a function definition, which I call from my window manager to quickly check my Org agenda.

** arni-programming
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-programming.el"
:END:

I may not have a lot to say in this module, because I have really not modified Emacs's programming modes nor behavior much.
Its defaults are all good for me currently, and the only thing I need is an Org-like structure which ~outline-mode~ offers.

When I program, the languages I use are usually Emacs Lisp and Python.
I may have to dabble in other languages if, say, I use a program which is configured in neither Python not Emacs Lisp.

Let's look at the configurations, now.

*** ~sly~

I did do some dabbling in Common Lisp, since... I use Emacs Lisp, I'm interested in most Lisps then.
I found that SLY was a wonderful REPL for Common Lisp, so I decided to install it.

#+begin_src elisp
  ;;; arni-programming
  ;;; sly
  (use-package sly)
#+end_src

You can access its manual by evaluating this :

#+begin_example elisp
(info "(sly) Top")
#+end_example
or go to https://elpa.nongnu.org/nongnu/doc/sly/sly.html.

*** ~python-mode~

I don't have a ton for Python, haha.
This, for now, is my only configuration for Python :

#+begin_src elisp
  ;;; python-mode
  ;;; hooks
  (add-hook 'inferior-python-mode-hook
  	  '(lambda () (define-key inferior-python-mode-map (kbd "C-c C-h") 'python-eldoc-at-point)))

  (add-hook 'python-mode-hook
  	  '(lambda () (define-key python-mode-map (kbd "C-c C-h") 'python-eldoc-at-point)))

  (add-hook 'python-mode-hook 'whitespace-mode)
#+end_src

If you'd like to add more and more to your Python programming experience, you can check out this wiki page : https://www.emacswiki.org/emacs/PythonProgrammingInEmacs

*** ~c-mode~

I've been dabbling in the C language.
For now, all I would like is to have some boilerplate ready whenever a C file is created.
For this, I use the ~auto-insert-mode~ with a custom-defined template.

#+begin_src elisp
  (eval-after-load 'autoinsert
  '(define-auto-insert '("\\.c\\'" . "C skeleton")
     '(
       "Short description: "
       "/*\n "
       (file-name-nondirectory (buffer-file-name))
       " -- " str \n
       "Written on " (format-time-string "%A, %e %B %Y.") \n
       " */" > \n \n
       "#include <stdio.h>" \n
       "#include \""
       (file-name-sans-extension
        (file-name-nondirectory (buffer-file-name)))
       ".h\"" \n \n
       "int main(void)" \n
       "{" > \n
       > _ \n
       "return 0;" > \n
       "}" > \n)))
#+end_src

*** ~outline-mode~ to navigate source code buffers

I deeply like ~org-mode~, because it makes it a lot easier to navigate and mentally sort through everything.
And, since ~org-mode~ is based off of ~outline-mode~, I thought it good to use this minor mode for programming modes.

If you wanna read about it, you can go to this manual page :

#+begin_example elisp
(info "(emacs) Outline Mode")
#+end_example
or read https://www.gnu.org/software/emacs/manual/html_node/emacs/Outline-Mode.html.

If you wanna try it out, do watch out! There is the ~outline-mode~ which is a /major/ mode.
And, ~outline-minor-mode~ is a /minor/ mode, which is the one you'd want for programming major modes.

Here's the configuration !

#+begin_src elisp
  ;;; outline-mode
  (use-package outline
    :config
    (setq outline-minor-mode-cycle t
  	outline-minor-mode-cycle-filter t
  	outline-blank-line t
  	outline-default-state t
  	outline-minor-mode-use-buttons nil)
    ;; look into outline-minor-mode-highlight to underline headings ?
    :bind (:map outline-minor-mode-map
  	      ("M-h" . outline-mark-subtree)
  	      ("C-c C-u" . outline-up-heading)
  	      ("C-c C-b" . outline-backward-same-level)
  	      ("C-c C-f" . outline-forward-same-level)
  	      ("C-c C-p" . outline-previous-visible-heading)
  	      ("C-c C-n" . outline-next-visible-heading)
  	      ("C-c C-j" . consult-imenu))
    :hook
    (prog-mode . outline-minor-mode))
#+end_src

In order to easily manage buffer visibility, I set =outline-minor-mode-cycle= and =outline-minor-mode-cycle-filter= to 't'.
This way, I can easily cycle outline visibility with TAB and S-TAB respectively.
It also is smart, such so that hitting TAB while inside of a code block correctly indents text.
Wonderful !

