arnimacs.org
** arni-desktop
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-desktop.el"
:END:

This module hosts all of my configuration and packages, in order to use Emacs as a nice suite of applications.
You can essentially imagine this module as my personal desktop environment, except for the window manager!

*** Why use Emacs as a suite for a desktop environment ?

I'll try and keep it brief !

- I have a very easy access to the configurations of the tools I use
- Easier to use these tools as a power user, due to easy configuration
- Everything uses the same interface, thus simplifying manipulations of the information or interactions the tools offer
- Text manipulation (searching, highlighting, editing...) is easier for me than interacting through GUIs, especially in Emacs
- Tighter integration with my overall workflow
- Keeping this tight workflow just in my Emacs configuration makes it portable and easy to use as a drop-in replacement, across different Linux distributions or operating systems.

Now, let's talk about the configuration a bunch :].

*** ~dired~ as a file manager

I have already covered it in a separate module, but since I use it as my overall file manager, I thought it was good to mention.
If you did not already and are curious about how I configured it, please check out the [[*arni-dired][arni-dired]] module.

*** ~eww~ as a web browser

Just like with ~dired~, this is something I've already covered.
I like to use it as my primary web browser as it feels better than GUI browsers like Firefox.
But, I do use Firefox where needed :

- Need to look at a specific website that requires JS or is bad to look at otherwise
- Videos and music, if I don't have those locally downloaded

You can look at my [[*~eww~ configuration][~eww~ configuration]] to know more about ~eww~ and how I configured it.
*** ~org~, ~org-capture~, ~org-agenda~ as PKM and life management

Just like the other two... already talked about it :^].
Check the [[*arni-org][arni-org]] module for more information !

However, I like to use ~org-capture~ fom anywhere in my window manager.
I found some very interesting code on the Internet, which I will link below.

#+begin_src elisp
  ;;; org-capture from my wm
  (defadvice org-switch-to-buffer-other-window
      (after supress-window-splitting activate)
    "Delete the extra window if we're in a capture frame"
    (if (equal "capture" (frame-parameter nil 'name))
        (delete-other-windows)))

  (defadvice org-capture-finalize
      (after delete-capture-frame activate)
    "Advise capture-finalize to close the frame"
    (when (and (equal "capture" (frame-parameter nil 'name))
  	 (not (eq this-command 'org-capture-refile)))
      (delete-frame)))

  (defadvice org-capture-refile
      (after delete-capture-frame activate)
    "Advise org-refile to close the frame"
    (delete-frame))
    
  (defun activate-capture-frame ()
    "run org-capture in capture frame"
    (select-frame-by-name "capture")
    (switch-to-buffer (get-buffer-create "*scratch*"))
    (org-capture)) 
  ;; Call org-capture system-wide with : emacsclient -c -F '(quote (name . "capture"))' -e '(activate-capture-frame)'
  ;; Taken from https://www.reddit.com/r/emacs/comments/74gkeq/system_wide_org_capture/
#+end_src

Admittedly, I do not know which documentation to add here...

*** ~eshell~, ~eat~ as a shell and terminal emulator

Oh finally ! A thing I didn't talk about yet !
~eshell~ is a shell which is written entirely in Emacs Lisp, and thus integrates very well with Emacs as a whole.
One of its main draws is its extensibility, and the idea of interchangably using Lisp symbolic expressions and more traditional shell algorithms.
A nice example of how this can be used well is the ability to use, say, the ~rx~ library which heavily simplifies the construction of complex regular expressions.
Using this ~rx~ library, we can pass those simpler regular expressions to the Emacs shell and mix Emacs Lisp with CLI tools this way.
If you're curious about more of what ~eshell~ can do, you can watch this video : https://www.youtube.com/watch?v=9xLeqwl_7n0.

However, ~eshell~ is only a shell, and not a terminal emulator.
If you need a clarification on what is different between those two concepts, read this Reddit post : [[https://www.reddit.com/r/explainlikeimfive/]["ELI5 : What is the difference between a shell and a terminal ?"]].

Some terminal emulators like the external ~vterm~ or the native ~term~ exist, but they do not integrate with ~eshell~. And this is what ~eat~ offers!
It's a terminal emulator that can also integrate with ~eshell~ by sending anything more demanding, like visual output, to ~eat~.

You can read these two manual pages to read more about ~eshell~ and ~eat~ respectively :

#+begin_example elisp
(info "(eshell) Top")
(info "(eat) Top")
#+end_example
or respectively, go to :
- https://www.gnu.org/software/emacs/manual/html_mono/eshell.html
- https://mirrors.sjtug.sjtu.edu.cn/emacs-elpa/nongnu-devel/doc/eat.html

Here is the configuration, now.

**** ~eshell~ configuration

#+begin_src elisp
  ;;; arni-desktop
  ;;; eshell
  ;; use-package declaration
  
  (use-package eshell
    :config
    (setq eshell-prompt-function
        (lambda ()
          (concat
           (propertize (system-name) 'face '(:weight bold))
           " "
           (propertize (abbreviate-file-name (eshell/pwd)) 'face '(:weight bold))
           " "
           (propertize "λ" 'face '(:weight bold))
           (propertize " " 'face 'default))))
    (setq eshell-highlight-prompt nil)
    (setq eshell-prompt-regexp "^.* λ ")
    ;; defining complex hooks
    (add-hook 'eshell-mode-hook (lambda () (setenv "TERM" "dumb")))
    (add-hook 'eshell-mode-hook 'outline-minor-mode)
    (add-hook 'eshell-mode-hook (lambda () (setq-local outline-regexp (concat eshell-prompt-regexp ".*"))))
    (add-hook 'eshell-mode-hook (lambda ()
  				(setq-local imenu-generic-expression `(("Prompt" ,(concat eshell-prompt-regexp "\\(.*\\)") 1)))))
    :bind
    ("C-c t" . eshell))
#+end_src

Here, I do quite a few things, especially regarding hooks.
I first set the desired ~eshell~ prompt with ~eshell-prompt-function~. It looks like this on my end, when my pwd is my home folder :

#+begin_example text
arni-soapbox ~ λ
#+end_example

Then another variable, ~eshell-prompt-regexp~, is meant to define what the prompt can always be matched by in the form of a regular expression. And, it is quite useful for me in the last two hooks, as you may have seen.

If you've read about my appreciation for ~outline-mode~ here, you notice that I enable its minor mode in ~eshell~.

#+begin_example elisp
(add-hook 'eshell-mode-hook 'outline-minor-mode)
(add-hook 'eshell-mode-hook (lambda () (setq-local outline-regexp (concat eshell-prompt-regexp ".*"))))
#+end_example

Folding outlines in a shell or terminal emulator... huh?
Yes! And the regular expression I define as matching an outline is any line that contains my prompt, followed by any character of any amount.

I concatenate the two regular expressions that correspond to each concept, and make that the buffer-local variable of the outline regular expression in ~eshell~.
I can then cleanly fold everything, so that I do not stay with the clutter of other functions with large output. It also makes everything a ton more readable and manageable.

Then, as I did this modification... I wondered if I could make it so I could easily jump to any prompt I've entered.
I can use ~imenu~ for this, as well as any functions that use it such as ~consult-imenu~.

#+begin_example elisp
(add-hook 'eshell-mode-hook (lambda ()
    (setq-local imenu-generic-expression `(("Prompt" ,(concat eshell-prompt-regexp "\\(.*\\)") 1)))))
#+end_example

I did not talk of ~imenu~ up until now. If you do not know what it is, you can imagine it as a menu where all important elements can be quickly jumped to.
Function definitions, class definitions in programming, Org headings... it's quite nice.
You can read these manual pages to know more about ~imenu~ :

#+begin_example elisp
(info "(emacs) Imenu") ;; for a general overview of imenu
(info "(elisp) Imenu") ;; for how to configure and script around imenu
#+end_example

By default, there are no generic ~imenu~ expressions for ~eshell~ so I defined those myself.
It seems that the name for an ~imenu~ entry should be defined with _\\( <thing> \\)_, so that ~imenu~ picks it up.

All of the above make for a very comfortable experience with terminal use. It's readable and easy to navigate in.
Another change I could do is create a regular expression that only matches the last line and highlight it, so that I can see where the current prompt is much easier.

**** ~eshell~ aliases

~eshell~ can let you add aliases to its shell, which is of course quite useful.
The file(s) that Emacs reads is stored in the ~eshell-aliases-file~ variable.
By default, it is "/$HOME/.emacs.d/eshell/alias". It's what I use.

Now, here are my aliases !

#+begin_src text :tangle "../eshell/alias"
  alias .. cd .. && pwd && ls
  alias ... cd ../.. && pwd && ls
  alias .... cd ../../.. && pwd && ls
  alias f find-file $1
  alias fn find-file-other-window $1
  alias d dired $1
  alias la ls -AFGhl --color=always $1
  alias l ls -FGhl --color=always $1
  alias upd sudo vpm up
  alias searchsystem 'sudo find / -type f -iname "*$1*"'
  alias arni-nosyssleep xset s off -dpms && echo "xset s off -dpms"
  alias mkcd mkdir $1 && cd $1 && pwd
  alias vpnup wg-quick up cava201-semm001
#+end_src

I think the only thing to pay attention to is this : watch out for distro-specific commands.
This goes especially for things like update commands.

**** ~eat~ configuration

As mentionned previously, ~eat~ lets you use a terminal emulator that integrates with ~eshell~.
As a refresher, you can read the manual page for this package here :

#+begin_example elisp
(info "(eat) Top")
#+end_example

I don't have much to say here, so I will simply add the code now.

#+begin_src elisp
  ;;; eat
  ;; use-package declaration
  
  (use-package eat
      :defer t
      :config
      (add-hook 'eshell-load-hook #'eat-eshell-mode)
      (add-hook 'eshell-load-hook #'eat-eshell-visual-command-mode))
#+end_src

*** ~elfeed~ for RSS

I like to use ~elfeed~, which is an RSS reader inside of Emacs.
You can find more, over at https://github.com/skeeto/elfeed.

I don't have much to add, especially as there is no in-Emacs manual availalbe for it.

#+begin_src elisp
  (use-package elfeed
    :config				
    (setq elfeed-feeds
  	'(("https://meteoalerte.com/france/meteoalerte_rss.php" weather) ; Weather 
  	  ("http://static.fsf.org/fsforg/rss/blogs.xml" libreware) ; FSF Blogs feed
  	  ("https://tube.kher.nl/feeds/videos.xml?videoChannelId=1441" peertube) ; Yohann Hoarau
  	  ("https://tube.kher.nl/feeds/videos.xml?videoChannelId=1926" peertube) ; Gwên
  	  ("https://toobnix.org/feeds/videos.xml?videoChannelId=154" peertube) ; EmacsConf
  	  ("https://karthinks.com/index.xml" emacs) ; karthinks
  	  ("https://sachachua.com/blog/category/emacs/feed/index.xml" emacs) ; sacha chua
  	  ("http://yummymelon.com/devnull/feeds/all.atom.xml" emacs) ; charles choi
  	  ("https://futurism.com/feed" futurism)
  	  ("https://reporterre.net/spip.php?page=backend-simple" ecology)
  	  ("https://framablog.org/feed/" libreware))))
#+end_src

#+RESULTS:
: t

** arni-qol
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-qol.el"
:END:

Here, this module will host modifications I use to make Emacs more comfortable for me to use.
This mostly contains stuff like UIs, disabling and enabling specific minor modes and so on.

