arnimacs.org
*** ~modus-themes~ configuration

I really like Prot's themes, so I use one that I slightly modified to my own tastes. More of an e-ink coloring!

#+begin_src elisp
  ;;; arni-rice
  ;;; modus-themes
  ;; use-package declaration
  (use-package modus-themes
    :config
    (setq modus-operandi-palette-overrides ;; https://protesilaos.com/emacs/modus-themes#h:34c7a691-19bb-4037-8d2f-67a07edab150
  	'((comment red-faint))))

  ;; Conditional to apply the theme
  (if (daemonp) 
      (add-hook 'after-make-frame-functions 
     	      (lambda (frame) 
     		(with-selected-frame frame (load-theme 'modus-operandi t))))
    (load-theme 'modus-operandi t))
#+end_src

The Modus themes can be configured to have different colors than the defaults.
Also, due to some quirks I don't understand, just loading the theme is not something that Emacs likes when run as a daemon.
So, a conditional is made to regularly apply the theme when a new frame spawns.

*** ~default-frame-alist~ variable configuration

While going crazy over the difficulty of setting up a default font for the Emacs daemon, I found out about the ~default-frame-alist~ variable.
And it's very nice!! Quite similar to the ~display-buffer-alist~ variable, so I thought I'd use that.

And this comparison is really because it serves roughly the same purpose. You can define the default parameters a frame has, which lets you customize Emacs's behavior for those.
If you would like to know more, I suggest these info pages :

#+begin_example elisp
(info "(emacs) Frame Parameters")
#+end_example
or https://www.gnu.org/software/emacs/manual/html_node/emacs/Frame-Parameters.html for an overview of frame parameters...

And,
#+begin_example elisp
(info "(elisp) Window Frame Parameters")
#+end_example
or https://www.gnu.org/software/emacs/manual/html_node/elisp/Window-Frame-Parameters.html in order to get much more precise documentation of what you can do.

Here's my (very small) configuration !

#+begin_src elisp
  ;;; default-frame-alist
  (setq default-frame-alist
        '((font . "Atkinson Hyperlegible Mono")
  	(vertical-scroll-bars . nil)))
#+end_src
*** ~spacious-padding-mode~ configuration (untangled)

I like having readable things.
~spacious-padding-mode~ makes things readable. So I use it!

What it does is add padding around Emacs windows to make it easier to read everything. It also changes the modeline into something I like much, much more.

If you wanna read a bit more about it, look at :

#+begin_example elisp
(info "(spacious-padding) Top")
#+end_example

or at https://protesilaos.com/emacs/spacious-padding.

#+begin_src elisp :tangle no
  (use-package spacious-padding
    :init
    (setq spacious-padding-subtle-mode-line t)
    :config
    (spacious-padding-mode 1))
#+end_src
*** My modeline (untangled)

I decided to make my own modeline, with very minimal information. Just what I need!
Although it is VERY minimal, so likely I will look into adding eye-candy at some point.

I also like to switch between this DIY modeline and ~doom-modeline~.
So, I may switch between one another.
I do prefer ~doom-modeline~ for more modern interfaces, like if I were on KDE.

#+begin_src elisp :tangle no
  ;;; My modeline configuration
  (setq display-time-format "%H:%M"
        display-time-default-load-average nil)

  (setq-default mode-line-format
        (list
         ;; start of modeline left part
         (propertize "'(" 'face '(:foreground "grey50"))
         ;; name of major mode
         "%m: "
         ;; buffer name
         "%b%&"
         (propertize ")" 'face '(:foreground "grey50"))
         ;; end of modeline left part
         'mode-line-format-right-align
         ;; start of modeline right part
         (propertize "'(" 'face '(:foreground "grey50"))
         ;; line number
         "%l . %c"
         ;; end of modeline
         (propertize ")" 'face '(:foreground "grey50"))))
#+end_src

It roughly looks something like :
#+begin_example text
'(Org: arnimacs.org*)                           '(1641 . 54)
#+end_example

To know a bit more about customizing the Emacs mode-line, you can look at the following resources...

*EmacsWiki on customizing the mode-line*

See https://www.emacswiki.org/emacs/ModeLineConfiguration

*Emacs manual pages on the mode-line*

#+begin_example elisp
(info "(elisp) Mode Line Basics")
#+end_example
or https://www.gnu.org/software/emacs/manual/html_node/elisp/Mode-Line-Basics.html
*** ~doom-modeline~ configuration

So, this is my /other/ modeline configuration !
As said in the previous heading, I prefer to use this modeline when other parts of my system "look" more modern.
What prompted me to look into this was the fact that I moved to KDE : my personal modeline feels quite ugly, inside of a KDE environment.
Something something graphical cohesion...

Well, anyways.
Here is my configuration of said modeline :

#+begin_src elisp
  (use-package doom-modeline
    :init
    (setq doom-modeline-buffer-encoding nil
  	doom-modeline-support-imenu t)
    (column-number-mode 1)
    :config
    (doom-modeline-mode 1))
#+end_src
*** ~tab-bar-mode~ faces configuration

I like to pretty things up, so I wanted to have a nice tab that resembles that of more modern editors.
I found this Reddit post that recreates that look very well, here it is : [[https://www.reddit.com/r/emacs/comments/1dfn295/changing_the_face_in_the_unused_portion_of_the/]].

The configuration is here :

#+begin_src elisp :results no
  (add-hook 'server-after-make-frame-hook
  	  (lambda ()
  		(set-face-attribute 'tab-bar nil :inherit 'fixed-pitch :background "Gray96" :underline '(:color "black" :style line :position t) :font "Atkinson Hyperlegible Next")
  		(set-face-attribute 'tab-bar-tab nil :inherit 'tab-bar :box '(:line-width (6 . 4) :color "white") :overline "black" :background "white" :underline 'nil)
  		(set-face-attribute 'tab-bar-tab-inactive nil :inherit '(shadow tab-bar-tab) :background "Gray96" :overline t :underline '(:color "black" :style line :position t))))

  (setq tab-bar-separator 'nil)
  (setq tab-bar-new-button-show nil)
  (setq tab-bar-new-tab-choice "*scratch*")
  (setq tab-bar-show t)
  (setq tab-bar-format '(tab-bar-format-tabs tab-bar-separator tab-bar-format-align-right))
  (defun tab-bar-tab-name-format-default (tab i)
    (let ((current-p (eq (car tab) 'current-tab)))
      (concat (propertize " " 'face `(:background "Black" )
  			'display '(space :width (1)))
  	    (propertize
  	     (concat (if tab-bar-tab-hints (format "%d " i) "")
  		     (alist-get 'name tab)
  		     (or (and tab-bar-close-button-show
  			      (not (eq tab-bar-close-button-show
  				       (if current-p 'non-selected 'selected)))
  			      tab-bar-close-button)
  			 ""))
  	     'face (funcall tab-bar-tab-face-function tab))
  	    (propertize " " 'face `(:background "Black" )
  			'display '(space :width (1))))))
  (tab-bar-history-mode t)
  (tab-bar-mode t)
#+end_src

#+RESULTS:
: t

** arni-tests
:PROPERTIES:
:header-args: :tangle "./arnimacs-modules/arni-tests.el" :results none
:END:

These are tests I like to add to my configuration, in order to try out new things and potentially better workflows.
I prefer putting them here specifically as they are more experimental.

*** Lightweight and efficient Avy replacement

I use Avy only to quickly jump to specific things.
I notice, however, that it is too mentally taxing to regularly use due to processing which candidate is the correct one, and thus which key stroke is the best.

Isearch offers less mental tax, but might be more cumbersome.
I decided to therefore try an Isearch configuration that will regexp-search for the beginning of any word in the buffer.

With some small tests, I notice it was VERY efficient and was less bothering to regularly use compared to Avy.
An upside to this is that I can easily leverage other isearch-related features, such as a quick jump to an Occur buffer with the current search regexp.

#+begin_src elisp
  ;; lightweight avy replacement
  (global-set-key (kbd "C-j")
  	(lambda ()
  	  (interactive)
  	  (push-mark)
  	  (isearch-resume "\\<" t nil t "\\<" t)))

  (define-key isearch-mode-map (kbd "C-j") 'avy-isearch)
  (use-package org
    :config
    (define-key org-mode-map (kbd "C-j")
  	      (lambda ()
  		(interactive)
  		(push-mark)
  		(isearch-resume "\\<" t nil t "\\<" t)))
    ;; reverse
    (define-key org-mode-map (kbd "C-S-j")
  	      (lambda ()
    		(interactive)
  		(push-mark)
    		(isearch-resume "\\<" t nil nil "\\<" t))))

  ;; reverse
  (global-set-key (kbd "C-S-j")
  	(lambda ()
  	  (interactive)
  	  (push-mark)
  	  (isearch-resume "\\<" t nil nil "\\<" t)))

#+end_src

*** Update notifier, WIP

A small test to be notified of how many packages I need to update.
Lets me have updated packages often, instead of forgetting all the time !
Now, I need to find a way to be notified of such a thing.
Maybe in the mode-line ?

#+begin_src elisp :tangle no
(let ((upgradeable-amount (length (package--upgradeable-packages))))
	      (message
	       (cond
		((equal upgradeable-amount 0) "No packages to upgrade")
		((equal upgradeable-amount 1) "1 package to upgrade")
		(t (format "%s packages to upgrade" upgradeable-amount)))))
#+end_src

** Loading all modules in the =init.el= file
:PROPERTIES:
:header-args: :tangle "../init.el"
:END:

In order to load all modules easily, I made a small utility function
that will load every =.el= file in a given directory.

#+begin_src elisp
  (defun arni/load-files-in-dir (dir)
    (let ((el-files (directory-files dir nil "\\.el$" t))
  	(file-path nil))
      (dolist (file el-files nil)
        (setq file-path (concat dir "/" file))
        (load-file file-path))))

  (arni/load-files-in-dir "/home/arni/.emacs.d/arnimacs/arnimacs-modules") ;; specify an absolute path!
#+end_src

* My contact information

If you have any questions, you can do the following :

- Send me a DM on Discord or Matrix, if you have my username.
  (I don't feel like sharing it everywhere, sorry!)
- Send me a message on my Reddit account, u/arni_ca.
  https://www.reddit.com/user/arni_ca/
- Send me mail at arni@disroot.org.
